<?php

namespace Faker\Provider\fa_IR;

class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = [
        'حساس', 'ترافیک', 'فروش', 'سایت', 'ارگانیک', 'افزایش', 'نرخ', 'سئو', 'کاربردی', 'ابزار', 'بهبود', 'تجربه', 'بهبود', 'فروشگاه', 'سرعت', 'جستجو', 'موتورهای جستجو', 'موبایل', 'آنلاین', 'لینک', 'حرفه', 'کلیک', 'مخاطب', 'صفحه', 'تصاویر', 'اشتراک', ' شبکه ها اجتماعی', 'محصول', 'توسعه دهنده', 'حرفه ای', 'فاکتور', 'بهینه سازی', 'ترافیک', 'پروتکل', 'امنیت', 'محتوا', 'دانلود', 'رایگان', 'استاندارد', 'خرید', 'رتبه بندی', 'الگوریتم های گوگل', 'وب گردی', 'وبلاگ نویس', 'مخاطب', 'رپورتاژ خبری', 'مقایسه', ' اطلاعات', 'نقشه', 'برچسب', 'بانک', 'چشم پوشی', 'اینترنت', 'پیامرسان', 'دولت', 'حمایت', 'هیولا', 'یادداشت', 'لینوکس', 'هوشمند', 'عروسک', 'رباتیک', 'کودکان', 'کتاب', 'بروزرسانی', 'وبمستر', 'آنالیتیکس', 'اقتصاد'
    ];
}
