<?php

namespace Faker\Provider\fa_IR;

class Address extends \Faker\Provider\Address
{
    protected static $streetPrefix = ['خیابان'];
    protected static $buildingNamePrefix = ['ساختمان'];
    protected static $buildingNumberPrefix = ['پلاک', 'قطعه'];
    protected static $postcodePrefix = ['کد پستی'];

    protected static $cityName = [
        'تهران', 'مشهد', 'اصفهان', 'شیراز', 'تبریز', 'اهواز', 'کرج', 'قم', 'ارومیه', 'رشت','کرمانشاه', 'زاهدان', 'اراک', 'کرمان', 'سنندج', 'بندرعباس', 'همدان', 'یاسوج', 'گرگان', 'ساری','خرم‌آباد', 'زنجان', 'قزوین', 'ایلام', 'بوشهر', 'بیرجند', 'بجنورد', 'یزد', 'سبزوار', 'کاشان','نجف‌آباد', 'مرند', 'ساوه', 'رفسنجان', 'شهرکرد', 'بابل', 'آمل', 'قائم‌شهر', 'نور', 'چالوس','نوشهر', 'محمودآباد', 'بابلسر', 'تنکابن', 'نکا', 'بهشهر', 'رامسر', 'گرمسار', 'دامغان', 'شاهرود','بیرجند', 'قوچان', 'نیشابور', 'تربت حیدریه', 'کاشمر', 'خواف', 'درگز', 'چابهار', 'خاش', 'ایرانشهر','سراوان', 'طبس', 'طبس مسینا', 'طبس گلشن', 'نهبندان', 'گناباد', 'سرخس', 'طرقبه', 'شاندیز', 'تربت جام','اردبیل', 'خلخال', 'مشگین‌شهر', 'نیر', 'پارس‌آباد', 'بیله‌سوار', 'کوثر', 'گرمی', 'نمین', 'سرعین','بوکان', 'مهاباد', 'سردشت', 'نقده', 'پیرانشهر', 'سلماس', 'خوی', 'میاندوآب', 'تکاب', 'شاهین‌دژ','مراغه', 'مرند', 'میانه', 'هریس', 'جلفا', 'سراب', 'اهر', 'بناب', 'ملکان', 'هشترود','فسا', 'مرودشت', 'نی‌ریز', 'لار', 'داراب', 'کازرون', 'آباده', 'جهرم', 'اقلید', 'سپیدان','سیرجان', 'رفسنجان', 'زرند', 'جیرفت', 'بافت', 'بردسیر', 'راور', 'عنبرآباد', 'کهنوج', 'قلعه گنج','ایذه', 'ماهشهر', 'آبادان', 'خرمشهر', 'دزفول', 'شوشتر', 'اندیمشک', 'شوش', 'بهبهان', 'امیدیه','بروجرد', 'الیگودرز', 'دورود', 'ازنا', 'کوهدشت', 'پلدختر', 'نورآباد', 'الشتر', 'ملایر', 'تویسرکان','نهاوند', 'رزن', 'کبودرآهنگ', 'اسدآباد', 'قروه', 'بیجار', 'کامیاران', 'دیواندره', 'مریوان', 'بانه','سقز', 'سنندج', 'دهگلان', 'بندر لنگه', 'قشم', 'میناب', 'حاجی‌آباد', 'رودان', 'پارسیان', 'بستک'
    ];

    protected static $state = [
        'آذربایجان شرقی','آذربایجان غربی','اردبیل','اصفهان','البرز','ایلام','بوشهر','تهران','چهارمحال و بختیاری','خراسان جنوبی','خراسان رضوی','خراسان شمالی','خوزستان','زنجان','سمنان','سیستان و بلوچستان','فارس','قزوین','قم','کردستان','کرمان','کرمانشاه','کهگیلویه و بویراحمد','گلستان','گیلان','لرستان','مازندران','مرکزی','هرمزگان','همدان','یزد'
    ];

    protected static $cityFormats = [
        '{{cityName}}',
    ];

    protected static $streetNameFormats = [
        '{{streetPrefix}} {{lastName}}',
    ];
    protected static $streetAddressFormats = [
        '{{streetName}} {{building}}',
    ];
    protected static $addressFormats = [
        '{{city}} {{streetAddress}} {{postcodePrefix}} {{postcode}}',
        '{{city}} {{streetAddress}}',
    ];
    protected static $buildingFormat = [
        '{{buildingNamePrefix}} {{firstName}} {{buildingNumberPrefix}} {{buildingNumber}}',
        '{{buildingNamePrefix}} {{firstName}}',
    ];

    protected static $postcode = ['##########'];
    protected static $country = [
        'ایران', 'افغانستان', 'پاکستان', 'عراق', 'ترکیه', 'سوریه', 'لبنان', 'اردن', 'عربستان سعودی','کویت', 'قطر', 'بحرین', 'امارات متحده عربی', 'عمان', 'یمن', 'مصر', 'لیبی', 'الجزایر', 'مراکش','تونس', 'سودان', 'نیجر', 'چاد', 'اریتره', 'اتیوپی', 'سومالی', 'کنیا', 'اوگاندا', 'رواندا','بروندی', 'تانزانیا', 'زامبیا', 'زیمبابوه', 'موزامبیک', 'آنگولا', 'نامیبیا', 'بوتسوانا', 'آفریقای جنوبی','لسوتو', 'اسواتینی', 'کنگو (جمهوری دموکراتیک)', 'کنگو (جمهوری)', 'گابن', 'آفریقای مرکزی', 'کامرون', 'غنا', 'ساحل عاج','سنگال', 'گینه', 'گینه بیسائو', 'گامبیا', 'سیرالئون', 'لیبریا', 'نیجریه', 'مالی', 'بورکینافاسو', 'تگو','بنین', 'موریتانی', 'جزایر قمر', 'ماداگاسکار', 'موریس', 'سیشل', 'کابو ورد', 'سائوتومه و پرنسیپ', 'آلمان', 'فرانسه','ایتالیا', 'اسپانیا', 'پرتغال', 'هلند', 'بلژیک', 'لوکزامبورگ', 'اتریش', 'سوئیس', 'نروژ', 'سوئد','دانمارک', 'فنلاند', 'ایسلند', 'بریتانیا', 'ایرلند', 'یونان', 'قبرس', 'جمهوری چک', 'اسلواکی', 'لهستان','مجارستان', 'رومانی', 'بلغارستان', 'صربستان', 'کرواسی', 'اسلوونی', 'بوسنی و هرزگوین', 'مقدونیه شمالی', 'مونته‌نگرو', 'آلبانی','اوکراین', 'روسیه', 'بلاروس', 'مولداوی', 'ارمنستان', 'گرجستان', 'آذربایجان', 'قزاقستان', 'ترکمنستان', 'ازبکستان','تاجیکستان', 'قرقیزستان', 'چین', 'هند', 'ژاپن', 'کره جنوبی', 'کره شمالی', 'ویتنام', 'تایلند', 'میانمار','مالزی', 'سنگاپور', 'اندونزی', 'فیلیپین', 'برونئی', 'کامبوج', 'لائوس', 'بنگلادش', 'نپال', 'بوتان','سری‌لانکا', 'مالدیو', 'استرالیا', 'نیوزیلند', 'پاپوا گینه نو', 'فیجی', 'ساموآ', 'تونگا', 'ونواتو', 'جزایر سلیمان','ایالات متحده آمریکا', 'کانادا', 'مکزیک', 'کوبا', 'جامائیکا', 'هائیتی', 'جمهوری دومینیکن', 'گواتمالا', 'السالوادور', 'نیکاراگوئه','هندوراس', 'کاستاریکا', 'پاناما', 'کلمبیا', 'ونزوئلا', 'اکوادور', 'پرو', 'بولیوی', 'شیلی', 'آرژانتین','برزیل', 'اروگوئه', 'پاراگوئه', 'سورینام', 'گویان', 'ترینیداد و توباگو', 'باهاما', 'باربادوس', 'آنتیگوا و باربودا', 'سنت لوسیا','سنت وینسنت و گرنادین‌ها', 'گرانادا', 'بلیز', 'گینه نو', 'وانواتو', 'قرقیزستان', 'سائو تومه و پرنسیپ', 'کیپ ورد', 'جزایر مارشال', 'پالائو','مالتا', 'سان مارینو', 'واتیکان', 'اندورا', 'لیختن‌اشتاین', 'موناکو', 'گرینلند', 'جزایر فارو', 'بنگلادش', 'آنگویلا'
    ];

    /**
     * @example 'زنجان'
     */
    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example 'خیابان'
     */
    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    /**
     * @example 'ساختمان'
     */
    public static function buildingNamePrefix()
    {
        return static::randomElement(static::$buildingNamePrefix);
    }

    /**
     * @example 'پلاک'
     */
    public static function buildingNumberPrefix()
    {
        return static::randomElement(static::$buildingNumberPrefix);
    }

    /**
     * @example 'ساختمان آفتاب پلاک 24'
     */
    public function building()
    {
        $format = static::randomElement(static::$buildingFormat);

        return $this->generator->parse($format);
    }

    /**
     * @example 'کد پستی'
     */
    public static function postcodePrefix()
    {
        return static::randomElement(static::$postcodePrefix);
    }

    /**
     * @example 'ایلام'
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }
}
